Stepan_Chaparyan/Homeworks/web/Jmeter/Homework_24_09_18/jmeter.log
2018-09-24 23:53:38,398 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2018-09-24 23:53:38,421 INFO o.a.j.JMeter: Loading user properties from: /home/chaparyan/Downloads/apache-jmeter-5.0/bin/user.properties
2018-09-24 23:53:38,422 INFO o.a.j.JMeter: Loading system properties from: /home/chaparyan/Downloads/apache-jmeter-5.0/bin/system.properties
2018-09-24 23:53:38,432 INFO o.a.j.JMeter: Copyright (c) 1998-2018 The Apache Software Foundation
2018-09-24 23:53:38,433 INFO o.a.j.JMeter: Version 5.0 r1840935
2018-09-24 23:53:38,433 INFO o.a.j.JMeter: java.version=1.8.0_181
2018-09-24 23:53:38,433 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2018-09-24 23:53:38,433 INFO o.a.j.JMeter: os.name=Linux
2018-09-24 23:53:38,433 INFO o.a.j.JMeter: os.arch=amd64
2018-09-24 23:53:38,433 INFO o.a.j.JMeter: os.version=4.15.0-34-generic
2018-09-24 23:53:38,433 INFO o.a.j.JMeter: file.encoding=UTF-8
2018-09-24 23:53:38,434 INFO o.a.j.JMeter: Max memory     =1073741824
2018-09-24 23:53:38,434 INFO o.a.j.JMeter: Available Processors =4
2018-09-24 23:53:38,439 INFO o.a.j.JMeter: Default Locale=English (EN)
2018-09-24 23:53:38,440 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2018-09-24 23:53:38,440 INFO o.a.j.JMeter: JMeterHome=/home/chaparyan/Downloads/apache-jmeter-5.0
2018-09-24 23:53:38,440 INFO o.a.j.JMeter: user.dir  =/home/chaparyan
2018-09-24 23:53:38,440 INFO o.a.j.JMeter: PWD       =/home/chaparyan
2018-09-24 23:53:38,440 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: stepn FullName: stepn
2018-09-24 23:53:38,442 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/home/chaparyan/jmeter_results'
2018-09-24 23:53:38,445 INFO o.a.j.s.FileServer: Default base='/home/chaparyan'
2018-09-24 23:53:38,451 INFO o.a.j.s.FileServer: Set new base='/home/chaparyan'
2018-09-24 23:53:38,666 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2018-09-24 23:53:38,682 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2018-09-24 23:53:38,688 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2018-09-24 23:53:38,697 INFO o.a.j.s.SaveService: Loading file: User specific request.jmx
2018-09-24 23:53:38,789 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-09-24 23:53:38,789 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-09-24 23:53:38,789 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-09-24 23:53:38,789 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2018-09-24 23:53:38,789 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2018-09-24 23:53:38,789 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2018-09-24 23:53:38,810 INFO o.a.j.JMeter: Creating summariser <summary>
2018-09-24 23:53:38,817 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2018-09-24 23:53:38,817 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: log3.jtl
2018-09-24 23:53:38,817 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /home/chaparyan/Downloads/apache-jmeter-5.0/bin/reportgenerator.properties
2018-09-24 23:53:38,818 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2018-09-24 23:53:38,833 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2018-09-24 23:53:38,837 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2018-09-24 23:53:38,837 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2018-09-24 23:53:38,837 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2018-09-24 23:53:38,837 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2018-09-24 23:53:38,837 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2018-09-24 23:53:38,838 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2018-09-24 23:53:38,838 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2018-09-24 23:53:38,839 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2018-09-24 23:53:38,850 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2018-09-24 23:53:38,851 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2018-09-24 23:53:38,851 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2018-09-24 23:53:38,851 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2018-09-24 23:53:38,851 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2018-09-24 23:53:38,852 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2018-09-24 23:53:38,852 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2018-09-24 23:53:38,852 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2018-09-24 23:53:38,853 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2018-09-24 23:53:38,853 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2018-09-24 23:53:38,854 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2018-09-24 23:53:38,854 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2018-09-24 23:53:38,855 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2018-09-24 23:53:38,861 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2018-09-24 23:53:38,861 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2018-09-24 23:53:38,862 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2018-09-24 23:53:38,870 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2018-09-24 23:53:38,870 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2018-09-24 23:53:39,432 INFO o.a.j.JMeter: Running test (1537818819432)
2018-09-24 23:53:39,473 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2018-09-24 23:53:39,474 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Thread Group.
2018-09-24 23:53:39,474 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2018-09-24 23:53:39,474 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=1 perThread=200.0 delayedStart=false
2018-09-24 23:53:39,496 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2018-09-24 23:53:39,496 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2018-09-24 23:53:39,562 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2018-09-24 23:53:39,564 INFO o.a.j.s.FileServer: Stored: /home/chaparyan/Downloads/bookID.csv
2018-09-24 23:53:39,565 INFO o.a.j.c.LoopController: iterationStart called on User specific request with source org.apache.jmeter.control.TestFragmentController@4d62cb5a and iteration 0
2018-09-24 23:53:39,590 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = stepn
2018-09-24 23:53:39,598 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2018-09-24 23:53:39,600 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2018-09-24 23:53:39,600 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2018-09-24 23:53:39,601 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2018-09-24 23:53:39,601 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2018-09-24 23:53:39,762 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-2
2018-09-24 23:53:39,763 INFO o.a.j.c.LoopController: iterationStart called on User specific request with source org.apache.jmeter.control.TestFragmentController@587071a5 and iteration 0
2018-09-24 23:53:39,961 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-3
2018-09-24 23:53:39,962 INFO o.a.j.c.LoopController: iterationStart called on User specific request with source org.apache.jmeter.control.TestFragmentController@2ab2b703 and iteration 0
2018-09-24 23:53:40,168 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-4
2018-09-24 23:53:40,168 INFO o.a.j.c.LoopController: iterationStart called on User specific request with source org.apache.jmeter.control.TestFragmentController@156cb949 and iteration 0
2018-09-24 23:53:40,361 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-5
2018-09-24 23:53:40,362 INFO o.a.j.c.LoopController: iterationStart called on User specific request with source org.apache.jmeter.control.TestFragmentController@7b5d3c44 and iteration 0
2018-09-24 23:53:41,067 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2018-09-24 23:53:41,078 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2018-09-24 23:53:41,078 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2018-09-24 23:53:42,117 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2018-09-24 23:53:42,119 INFO o.a.j.u.SSLManager: KeyStore created OK
2018-09-24 23:53:42,119 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2018-09-24 23:53:43,281 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2018-09-24 23:53:43,281 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2018-09-24 23:53:43,315 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-4
2018-09-24 23:53:43,315 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-4
2018-09-24 23:53:43,318 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-2
2018-09-24 23:53:43,318 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-2
2018-09-24 23:53:43,326 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-3
2018-09-24 23:53:43,326 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-3
2018-09-24 23:53:43,335 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-5
2018-09-24 23:53:43,335 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-5
2018-09-24 23:53:43,336 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2018-09-24 23:53:43,337 INFO o.a.j.s.FileServer: Close: /home/chaparyan/Downloads/bookID.csv
2018-09-24 23:53:43,339 INFO o.a.j.r.Summariser: summary =     25 in 00:00:04 =    6.4/s Avg:   663 Min:    86 Max:  2953 Err:     0 (0.00%)
2018-09-24 23:53:43,339 INFO o.a.j.JMeter: Generating Dashboard
2018-09-24 23:53:43,340 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2018-09-24 23:53:43,371 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2018-09-24 23:53:43,572 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2018-09-24 23:53:43,572 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2018-09-24 23:53:43,575 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2018-09-24 23:53:43,575 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2018-09-24 23:53:43,581 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2018-09-24 23:53:43,587 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2018-09-24 23:53:43,587 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2018-09-24 23:53:43,587 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2018-09-24 23:53:43,598 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2018-09-24 23:53:43,598 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2018-09-24 23:53:43,599 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2018-09-24 23:53:43,599 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2018-09-24 23:53:43,604 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2018-09-24 23:53:43,604 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 175 samples
2018-09-24 23:53:43,605 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2018-09-24 23:53:43,605 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2018-09-24 23:53:43,605 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2018-09-24 23:53:43,606 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2018-09-24 23:53:43,606 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2018-09-24 23:53:43,607 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2018-09-24 23:53:43,625 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2018-09-24 23:53:43,625 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2018-09-24 23:53:43,625 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2018-09-24 23:53:43,626 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2018-09-24 23:53:43,626 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 375 samples
2018-09-24 23:53:43,626 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 75 samples
2018-09-24 23:53:43,626 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 25 samples
2018-09-24 23:53:43,628 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 25 samples produced in 213ms on channel 0
2018-09-24 23:53:43,628 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2018-09-24 23:53:43,632 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /home/chaparyan/jmeter_results
2018-09-24 23:53:43,785 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /home/chaparyan/jmeter_results, creating folder structure
2018-09-24 23:53:44,857 INFO o.a.j.JMeter: Dashboard generated